Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: <input type="checkbox" id="reactive" name="reactive" value="reactive"><label for="reactive"> Reactive</label>
ja_jp: <input type="checkbox" id="reactive" name="reactive" value="reactive"><label for="reactive"> リアクティブ</label>

source: <input type="checkbox" id="security" name="security" value="security"><label for="security"> Security</label>
ja_jp: <input type="checkbox" id="security" name="security" value="security"><label for="security"> セキュリティー</label>

source: <input type="checkbox" id="serialization" name="serialization" value="serialization"><label for="serialization"> Serialization</label>
ja_jp: <input type="checkbox" id="serialization" name="serialization" value="serialization"><label for="serialization"> シリアライゼーション</label>

source: <input type="text" id="search-text" placeholder="Keyword Search" />
ja_jp: <input type="text" id="search-text" placeholder="キーワード検索" />

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
ja_jp: <span class="icon"><i class="fa fa-lock" title="ビルド時に固定"></i></span>ビルド時に固定される設定プロパティ - 他のすべての設定プロパティは実行時にオーバーライド可能 <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-1" placeholder="FILTER CONFIGURATION" disabled>
ja_jp: <span class="icon"><i class="fa fa-lock" title="ビルド時に固定"></i></span> ビルド時に固定される設定プロパティ - 他のすべての設定プロパティは、実行時にオーバーライド可能 <input type="search" id="config-search-1" placeholder="FILTER CONFIGURATION" disabled>

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-2" placeholder="FILTER CONFIGURATION" disabled>
ja_jp: <span class="icon"><i class="fa fa-lock" title="ビルド時に固定"></i></span> ビルド時に固定される設定プロパティ - 他のすべての設定プロパティは、実行時にオーバーライド可能 <input type="search" id="config-search-2" placeholder="FILTER CONFIGURATION" disabled>

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-3" placeholder="FILTER CONFIGURATION" disabled>
ja_jp: <span class="icon"><i class="fa fa-lock" title="ビルド時に固定"></i></span> ビルド時に固定される設定プロパティ - 他のすべての設定プロパティは、実行時にオーバーライド可能 <input type="search" id="config-search-3" placeholder="FILTER CONFIGURATION" disabled>

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-4" placeholder="FILTER CONFIGURATION" disabled>
ja_jp: <span class="icon"><i class="fa fa-lock" title="ビルド時に固定"></i></span> ビルド時に固定される設定プロパティ - 他のすべての設定プロパティは、実行時にオーバーライド可能 <input type="search" id="config-search-4" placeholder="FILTER CONFIGURATION" disabled>

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-5" placeholder="FILTER CONFIGURATION" disabled>
ja_jp: <span class="icon"><i class="fa fa-lock" title="ビルド時に固定"></i></span> ビルド時に固定される設定プロパティ - 他のすべての設定プロパティは、実行時にオーバーライド可能 <input type="search" id="config-search-5" placeholder="FILTER CONFIGURATION" disabled>

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-6" placeholder="FILTER CONFIGURATION" disabled>
ja_jp: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> ビルド時に固定された設定プロパティー。その他の設定プロパティーはすべて実行時にオーバーライド可能です。<input type="search" id="config-search-6" placeholder="FILTER CONFIGURATION" disabled>

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-7" placeholder="FILTER CONFIGURATION" disabled>
ja_jp: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> ビルド時に固定された設定プロパティー。その他の設定プロパティーはすべて実行時にオーバーライド可能です。<input type="search" id="config-search-7" placeholder="FILTER CONFIGURATION" disabled>

source: <strong>A2A (Agent-to-Agent):</strong> Supports reliable autonomous agent communication across ecosystems.
ja_jp: <strong>A2A (Agent-to-Agent):</strong> エコシステム全体で信頼性の高い自律エージェント通信をサポートします。

source: <strong>Asynchronous Ingestion:</strong> Utilize asynchronous ingestion to batch embeddings and stream deltas.
ja_jp: <strong>非同期取り込み:</strong> 非同期取り込みを活用して、埋め込みをバッチ処理し、デルタをストリームします。

source: <strong>Audit lineage:</strong> Store the chunk→document→source linkage with timestamps.
ja_jp: <strong>監査系譜:</strong> チャンク→ドキュメント→ソースの連携をタイムスタンプと共に保存します。

source: <strong>Auditable Decisions:</strong> Provides clear lineage and context for generated responses, crucial for compliance and debugging.
ja_jp: <strong>監査可能な決定:</strong> 生成された応答について明確な系譜とコンテキストを提供し、コンプライアンスとデバッグに不可欠です。

source: <strong>Authorization at retrieval:</strong> Before injecting context, filter by user/tenant claims.
ja_jp: <strong>検索時の認可:</strong> コンテキストを注入する前に、ユーザー/テナントのクレームでフィルタリングします。

source: <strong>Better latency and improved throughput:</strong> Quarkus generates highly optimized code at build time and prunes unnecessary classes and methods. For instance, it weaves layers of indirection together, enabling better JIT optimizations. These improvements result in faster code and better latency.
ja_jp: <strong>より良いレイテンシーとスループットの向上:</strong> Quarkusは、ビルド時に高度に最適化されたコードを生成し、不要なクラスやメソッドを削除します。例えば、間接参照の層を結合することで、JIT最適化を向上させます。これらの改善により、より高速なコードとより良いレイテンシーが実現します。

source: <strong>Caching:</strong> Cache query vectors and top-K hits for improved performance.
ja_jp: <strong>キャッシュ:</strong> パフォーマンス向上のために、クエリベクトルとトップKヒットをキャッシュします。

source: <strong>Complex Queries:</strong> Addresses intricate questions requiring synthesis from multiple sources.
ja_jp: <strong>複雑なクエリ:</strong> 複数のソースからの統合を必要とする複雑な問題に対応します。

source: <strong>Consistency Checks:</strong> Implement a final verifier prompt or apply deterministic post-rules.
ja_jp: <strong>一貫性チェック:</strong> 最終検証プロンプトを実装するか、決定論的な後処理ルールを適用します。

source: <strong>Cost Efficiency:</strong> By retrieving only the most relevant context chunks, prompts stay concise. This reduces token usage in LLM calls, which directly lowers cost while preserving accuracy and completeness.
ja_jp: <strong>コスト効率:</strong> 最も関連性の高いコンテキストチャンクのみを取得することで、プロンプトは簡潔に保たれます。これにより、LLM呼び出しでのトークン使用量が削減され、精度と完全性を維持しながらコストを直接削減できます。

source: <strong>Database Retriever:</strong> Extracts relevant data from structured databases.
ja_jp: <strong>データベース検索器:</strong> 構造化データベースから関連データを抽出します。

source: <strong>Decision Support:</strong> Aid in investments, vendor selection, and risk assessments.
ja_jp: <strong>意思決定支援:</strong> 投資、ベンダー選定、リスク評価を支援します。

source: <strong>Domain/Tenant Sharding:</strong> Retrieves information based on semantic similarity from a vector store.
ja_jp: <strong>ドメイン/テナントシャーディング:</strong> ベクトルストアからセマンティックな類似性に基づいて情報を検索します。

source: <strong>Dynamic Information:</strong> Handles rapidly changing data environments by incorporating real-time updates.
ja_jp: <strong>動的な情報:</strong> リアルタイムの更新を組み込むことで、急速に変化するデータ環境に対応します。

source: <strong>Full-Text Retriever:</strong> Performs keyword-based searches across a corpus of documents.
ja_jp: <strong>全文検索器:</strong> 文書コーパス全体でキーワードに基づいた検索を実行します。

source: <strong>Guard responses:</strong> Post-filter for data leakage and policy violations.
ja_jp: <strong>応答の保護:</strong> データ漏洩やポリシー違反がないか事後的にフィルタリングします。

source: <strong>High-Accuracy Needs:</strong> Reranking and injection ensure more precise and relevant answers.
ja_jp: <strong>高精度なニーズ:</strong> 再ランク付けと注入により、より正確で関連性の高い回答が保証されます。

source: <strong>Imperative model:</strong> A traditional synchronous approach with faster execution due to an optimized I/O layer, ideal for lower concurrency. High concurrency increases memory use.
ja_jp: <strong>命令型モデル:</strong> 最適化されたI/Oレイヤーにより実行が高速化された従来の同期アプローチで、並行処理が少ない場合に最適です。高並行処理ではメモリ使用量が増加します。

source: <strong>Improved Reasoning:</strong> Decompose complex problems to reduce logical errors.
ja_jp: <strong>推論の改善:</strong> 複雑な問題を分解して、論理的誤りを減らします。

source: <strong>Ingestion:</strong> This phase prepares enterprise knowledge for retrieval. In a frozen RAG setup, data typically originates from unstructured document sources such as manuals, PDFs, or reports.
ja_jp: <strong>取り込み (Ingestion):</strong> このフェーズでは、取得するための企業知識を準備します。Frozen RAGのセットアップでは、データは通常、マニュアル、PDF、レポートなどの非構造化ドキュメントソースから取得されます。

source: <strong>Java-Native Enterprise Integration:</strong> Quarkus provides a first-class runtime for embedding RAG workflows into existing enterprise systems. Developers can secure RAG services with OIDC or LDAP, expose them through familiar REST or Kafka APIs, and monitor them with Prometheus and OpenTelemetry. Because RAG runs inside the same application fabric as other Java services, it fits naturally into existing authentication, authorization, deployment, and observability workflows. This ensures AI augmentation is not just added, but part of the enterprise architecture.
ja_jp: <strong>Javaネイティブなエンタープライズ統合:</strong> Quarkusは、既存のエンタープライズシステムにRAGワークフローを組み込むためのファーストクラスのランタイムを提供します。開発者は、OIDCやLDAPでRAGサービスを保護し、使い慣れたRESTまたはKafka APIを通じて公開し、PrometheusやOpenTelemetryで監視できます。RAGは他のJavaサービスと同じアプリケーションファブリック内で実行されるため、既存の認証、認可、デプロイメント、および可観測性ワークフローに自然に適合します。これにより、AIオーグメンテーションが単に追加されるだけでなく、エンタープライズアーキテクチャの一部となります。

source: <strong>Lean Prompts:</strong> Prioritize token budget for context, keeping prompts concise.
ja_jp: <strong>リーンプロンプト:</strong> コンテキストのためのトークン予算を優先し、プロンプトを簡潔に保ちます。

source: <strong>Lower memory consumption:</strong> By minimizing allocations and class loading, Quarkus reduces memory usage. Replacing reflection with build-time bytecode generation further lowers the JVM's runtime workload.
ja_jp: <strong>メモリ消費量の削減:</strong> 割り当てとクラスロードを最小限に抑えることで、Quarkusはメモリ使用量を削減します。リフレクションをビルド時のバイトコード生成に置き換えることで、JVMのランタイムワークロードがさらに軽減されます。

source: <strong>MCP (Model context Protocol):</strong> Enables building servers and clients that integrate LLMs with enterprise systems.
ja_jp: <strong>MCP (Model context Protocol):</strong> LLMをエンタープライズシステムと統合するサーバーおよびクライアントの構築を可能にします。

source: <strong>PII controls:</strong> Redact or mask sensitive spans before embedding and prompting.
ja_jp: <strong>PII制御:</strong> 埋め込みとプロンプトの前に、機密性の高いスパンを編集またはマスクします。

source: <strong>Policy Application:</strong> Apply multi-clause rules with traceable steps.
ja_jp: <strong>ポリシー適用:</strong> 追跡可能なステップで複数条項のルールを適用します。

source: <strong>Query:</strong> This phase handles user queries and generates grounded answers.
ja_jp: <strong>クエリ (Query):</strong> このフェーズでは、ユーザーのクエリを処理し、根拠のある回答を生成します。

source: <strong>Reactive model:</strong> Enables high concurrency with minimal resources using asynchronous, non-blocking code, but is more complex to implement and debug.
ja_jp: <strong>リアクティブモデル:</strong> 非同期のノンブロッキングコードを使用し、最小限のリソースで高い並行処理を可能にしますが、実装とデバッグがより複雑になります。

source: <strong>Reasoning Exposure:</strong> Decide whether to reveal the Chain of Thought (CoT) or keep it internal.
ja_jp: <strong>推論の開示:</strong> Chain of Thought (CoT) を開示するか、内部に留めるかを決定します。

source: <strong>Reduced Hallucinations:</strong> RAG ensures that LLM answers are explicitly tied to enterprise-specific sources such as policies, manuals, or knowledge bases. This grounding reduces the risk of fabricated or misleading responses and increases trust in AI-assisted decision-making.
ja_jp: <strong>ハルシネーションの削減:</strong> RAGは、LLMの回答がポリシー、マニュアル、ナレッジベースなどの企業固有のソースに明示的に結び付けられるようにします。この根拠付けにより、捏造されたり誤解を招くような回答のリスクが減り、AIを活用した意思決定への信頼が高まります。

source: <strong>Reduced startup time:</strong> Quarkus performs most of the heavy work at build-time, significantly cutting startup time and allowing the app to reach peak performance faster.
ja_jp: <strong>起動時間の短縮:</strong> Quarkusは、重い処理のほとんどをビルド時に実行するため、起動時間を大幅に短縮し、アプリがより早くピークパフォーマンスに到達できるようにします。

source: <strong>Token Budgeting:</strong> Limit intermediate verbosity and summarize between steps.
ja_jp: <strong>トークン予算管理:</strong> 中間的な冗長性を制限し、ステップ間で要約します。

source: <strong>Training & Enablement:</strong> Illustrate the "why" behind concepts, not just the "what."
ja_jp: <strong>トレーニングとイネーブルメント:</strong> 概念の「何を」だけでなく、「なぜ」を説明します。

source: <strong>Transparency:</strong> Provide optional explanations for decisions.
ja_jp: <strong>透明性:</strong> 意思決定に関するオプションの説明を提供します。

source: <strong>Troubleshooting:</strong> Facilitate structured diagnostics in operations and engineering.
ja_jp: <strong>トラブルシューティング:</strong> 運用およびエンジニアリングにおいて、構造化された診断を容易にします。

source: <strong>Up-to-Date Information:</strong> Because the retrieval step pulls directly from current document repositories and databases, responses adapt automatically as content evolves. There is no need to retrain or fine-tune the underlying model whenever business data changes.
ja_jp: <strong>最新の情報:</strong> 取得ステップが現在のドキュメントリポジトリとデータベースから直接情報を引き出すため、コンテンツの進化に合わせて応答が自動的に適応します。ビジネスデータが変更されるたびに、基盤となるモデルを再トレーニングしたり、ファインチューニングしたりする必要はありません。

source: <strong>Vector Retriever:</strong> Retrieves information based on semantic similarity from a vector store.
ja_jp: <strong>ベクトル検索器:</strong> ベクトルストアからセマンティックな類似性に基づいて情報を検索します。

source: <strong>Virtual threads (JDK 21+):</strong> Combines the benefits of imperative and reactive models, allowing imperative code to run on lightweight virtual threads for high concurrency with low memory overhead, though some limitations remain.
ja_jp: <strong>仮想スレッド (JDK 21+):</strong> 命令型モデルとリアクティブモデルの利点を組み合わせ、命令型コードを軽量な仮想スレッドで実行することで、低いメモリオーバーヘッドで高い並行処理を可能にします。ただし、いくつかの制限は残ります。

source: <strong>Web/Search Retriever:</strong> Gathers information from the web or external search engines.
ja_jp: <strong>Web/検索検索器:</strong> Webまたは外部の検索エンジンから情報を収集します。

source: === If you also use xref:hibernate-orm.adoc#multitenancy[Hibernate ORM multitenancy] and both OIDC and Hibernate ORM tenant IDs are the same and must be extracted from the Vert.x `RoutingContext` then you can pass the tenant id from the OIDC Tenant Resolver to the Hibernate ORM Tenant Resolver as a `RoutingContext` attribute, for example:
ja_jp: === xref:hibernate-orm.adoc#multitenancy[Hibernate ORM マルチテナント] も使用し、OIDC と Hibernate ORM のテナント ID が同じで、Vert.x `RoutingContext` から抽出する必要がある場合は、OIDC テナントリゾルバから Hibernate ORM テナントリゾルバに `RoutingContext` 属性としてテナント ID を渡すことができます。例:

source: === When a current tenant represents an OIDC `web-app` application, the current `io.vertx.ext.web.RoutingContext` will contain a `tenant-id` attribute by the time the custom tenant resolver has been called for all the requests completing the code authentication flow and the already authenticated requests, when either a tenant specific state or session cookie already exists. Therefore, when working with mulltiple OpenID Connect Providers, you only need a path specific check to resolve a tenant id if the `RoutingContext` does not have the `tenant-id` attribute set, for example:
ja_jp: === 現在のテナントがOIDC `web-app` アプリケーションを表している場合、テナント固有の状態またはセッションクッキーが既に存在する場合、コード認証フローを完了するすべてのリクエストと既に認証されたリクエストに対してカスタムテナントリゾルバーが呼び出されるまでに、現在の `io.vertx.ext.web.RoutingContext` には `tenant-id` 属性が含まれます。 したがって、複数の OpenID Connect プロバイダを使用する場合は、 `RoutingContext` に `tenant-id` 属性が設定されていない場合など、テナント ID を解決するためのパス固有のチェックのみが必要になります。例:

source: @ConfigProperty doesn't support an expression language the way @Value does, but makes the typical use cases much easier to handle
ja_jp: ConfigurationProperty は、@Value とは違って式言語をサポートしていませんが、典型的な使用例をはるかに簡単に扱うことができます

source: @PermitAll is a JSR 250 common security annotation that indicates that the given endpoint is accessible by any caller, authenticated or not.
ja_jp: @PermitAll は、JSR 250 の一般的なセキュリティーアノテーションであり、認証されているかどうかに関係なく、特定のエンドポイントにすべての呼び出し元がアクセスできることを示します。

source: @PermitAll is a Jakarta common security annotation that indicates that the given endpoint is accessible by any caller, authenticated or not.
ja_jp: @PermitAllは、Jakarta共通セキュリティアノテーションで、認証されているかどうかにかかわらず、指定されたエンドポイントにはどの呼び出し元からもアクセスできることを示します。

source: @QuarkusTest @TestMethodOrder(MethodOrderer.OrderAnnotation.class) @VirtualThreadUnit // Use the extension @ShouldNotPin // Detect pinned carrier thread class TodoResourceTest { // ... }
ja_jp: @QuarkusTest @TestMethodOrder(MethodOrderer.OrderAnnotation.class) @VirtualThreadUnit // エクステンションを使用 @ShouldNotPin // ピン留めされたキャリアスレッドを検出 class TodoResourceTest { // ... }

source: @RequestMapping(produces="application/json")
ja_jp: @RequestMapping(produce="application/json")

source: @RestQuery will include parameter with key `name`
ja_jp: @RestQuery はキー `name` を持つパラメーターを含みます

source: @RolesAllowed is a JSR 250 common security annotation that indicates that the given endpoint is accessible by a caller if they have either a "User" or "Admin" role assigned.
ja_jp: @RolesAllowed は、"User" または "Admin" ロールが割り当てられている場合は呼び出し元が特定のエンドポイントにアクセスできることを示す JSR 250 の一般的なセキュリティーアノテーションです。

source: @TestTransaction annotation
ja_jp: @TestTransaction アノテーション

source: A "User Query" is received and processed by a "Query Embedding" component to create an embedding of the query.
ja_jp: 「User Query」が受信され、「Query Embedding」コンポーネントによって処理され、クエリの埋め込みが作成されます。

source: A "thread-like" data structure managed by the Operating System.
ja_jp: オペレーティングシステムによって管理される「スレッドのような」データ構造。

source: A "thread-like" data-structure managed by the Operating System.
ja_jp: オペレーティングシステムによって管理される「スレッド(より糸)のような」なデータ構造。

source: A (compile-time) annotation processor that scans the classpath for classes annotated with `@Mapper`, `@Dao` or `@Entity`, and generates code and CQL queries for them; and
ja_jp: `@Mapper` 、 `@Dao` または `@Entity` でアノテーションされたクラスについてクラスパスをスキャンし、それらのためのコードとCQLクエリを生成する（コンパイル時）アノテーション・プロセッサー、および

source: A *bean with a pseudo-scope* (`@Dependent` and `@Singleton` ) is created when injected.
ja_jp: 注入時に *疑似スコープを持つ Bean* (`@Dependent` および `@Singleton`) が作成されます。

source: A *normal scoped bean* (`@ApplicationScoped`, `@RequestScoped`, etc.) is needed when a method is invoked upon an injected instance (contextual reference per the specification).
ja_jp: 注入されたインスタンス (仕様に応じたコンテキスト参照) からメソッドが呼び出される場合は、*通常のスコープ付き Bean* (`@ApplicationScoped`、 `@RequestScoped` など) が必要になります。

source: A <<sections,section>> may contain static text, expressions and nested sections: `{#if foo.active}{foo.name}{/if}`. The name in the closing tag is optional: `{#if active}ACTIVE!{/}`. A section can be empty: `{#myTag image=true /}`. A section may also declare nested section blocks: `{#if item.valid} Valid. {#else} Invalid. {/if}` and decide which block to render.
ja_jp: <<sections,セクション>> は静的テキスト、式、ネストされたセクションを含むことができます( `{#if foo.active}{foo.name}{/if}` )。クロージングタグの名前はオプションです( `{#if active}ACTIVE!{/}` )。セクションは空にすることができます( `{#myTag image=true /}` )。セクションはネストしたセクションブロックを宣言することもでき ( `{#if item.valid} Valid. {#else} Invalid. {/if}` )、どのブロックをレンダリングするかを決定します。

source: A <<sections,section>> may contain static text, expressions and nested sections: `{#if foo.active}{foo.name}{/if}`. The name in the closing tag is optional: `{#if active}ACTIVE!{/}`. A section can be empty: `{#myTag image=true /}`. Some sections support optional end tags, i.e. if the end tag is missing then the section ends where the parent section ends. A section may also declare nested section blocks: `{#if item.valid} Valid. {#else} Invalid. {/if}` and decide which block to render.
ja_jp: <<sections,section>> には、静的テキスト、式、ネストされたセクションを含めることができます (`{#if foo.active}{foo.name}{/if}`)。 クロージングタグ内の名前はオプションです (`{#if active}ACTIVE!{/}`)。 セクションは空にできます (`{#myTag image=true /}`)。 一部のセクションでは、オプションの終了タグがサポートされます。つまり、終了タグがなければ、セクションは親セクションの終了位置で終了します。 セクションは、ネストしたセクションブロックを宣言することもでき (`{#if item.valid} Valid. {#else} Invalid. {/if}`)、どのブロックをレンダリングするかを決定します。

source: A Better Way of Creating Dev Services
ja_jp: Dev Services のより優れた作成方法

source: A CDI bean annotated with `@Named` can be referenced in any template through `cdi` and/or `inject` namespaces:
ja_jp: `@Named` でアノテーションされた CDI Bean は、`cdi` や `inject` 名前空間を通して、任意のテンプレートで参照することができます。

source: A CDI bean annotated with `@Named` can be referenced in any template through cdi and/or inject namespaces. Quarkus Tools for IntelliJ provides completion and definition navigation support for Beans.
ja_jp: `@Named` でアノテーションされた CDI Bean は、cdi および/または inject 名前空間を通じて、任意のテンプレートで参照することができます。Quarkus Tools for IntelliJは、Beanの補完と定義ナビゲーションのサポートを提供します。

source: A CDI bean annotated with `@Named` can be referenced in any template through cdi and/or inject namespaces. Quarkus Tools for Visual Studio Code provides completion and definition navigation support for Beans.
ja_jp: `@Named` でアノテーションされた CDI Bean は、cdi および/または inject 名前空間を通して、任意のテンプレートで参照することができます。Quarkus Tools for Visual Studio Codeは、Beanの補完と定義ナビゲーションのサポートを提供します。

source: A CDI bean instance is used at runtime - this means that the factory can define injection points
ja_jp: CDI Beanインスタンスは実行時に使用されます - これはファクトリーが注入ポイントを定義できることを意味します

source: A CDI bean with the permission checker must be either a normal scoped bean or a `@Singleton` bean.
ja_jp: 権限チェッカーを備えた CDI Bean は、通常のスコープ Bean または `@Singleton` Bean のいずれかである必要があります。

source: A CDI event is fired synchronously and asynchronously when the scheduler or a scheduled job is paused/resumed. The payload is `io.quarkus.scheduler.SchedulerPaused`, `io.quarkus.scheduler.SchedulerResumed`, `io.quarkus.scheduler.ScheduledJobPaused` and `io.quarkus.scheduler.ScheduledJobResumed` respectively.
ja_jp: CDIイベントは、スケジューラーやスケジュールされたジョブが一時停止/再開されたときに、同期および非同期で発生します。ペイロードはそれぞれ `io.quarkus.scheduler.SchedulerPaused` , `io.quarkus.scheduler.SchedulerResumed` , `io.quarkus.scheduler.ScheduledJobPaused` , `io.quarkus.scheduler.ScheduledJobResumed` です。

source: A CDI event of type `io.quarkus.scheduler.SkippedExecution` is fired when an execution of a scheduled method is skipped.
ja_jp: スケジュールされたメソッドの実行がスキップされると、 `io.quarkus.scheduler.SkippedExecution` のタイプのCDIイベントが発生します。

source: A CDI event of type `io.quarkus.scheduler.SuccessfulExecution` is fired synchronously and asynchronously when an execution of a scheduled method is successful. A CDI event of type `io.quarkus.scheduler.FailedExecution` is fired synchronously and asynchronously when an execution of a scheduled method throws an exception.
ja_jp: `io.quarkus.scheduler.SuccessfulExecution` 型の CDI イベントは、スケジュールされたメソッドの実行が成功したときに、同期および非同期で発生します。 `io.quarkus.scheduler.FailedExecution` タイプの CDI イベントは、スケジュールされたメソッドの実行が例外をスローしたときに、同期および非同期で発生します。

source: A CDI interceptor will create and register a counter called `counted.method`
ja_jp: CDI インターセプターは `counted.method` というカウンターを作成して登録します。

source: A CDI interceptor will create and register a timer called `call`
ja_jp: CDI インターセプターは `call` と呼ばれるタイマーを作成して登録します。

source: A CRON trigger is defined by a cron-like expression. For example `"0 15 10 * * ?"` fires at 10:15am every day.
ja_jp: CRONトリガーは、cronライクな式で定義されています。例えば `"0 15 10 * * ?"` は毎日午前10時15分に起動します。
